import pandas as pd
import numpy as np


SALE_DOCTYPE = {
    'करारनामा', 'सेल डीड', 'अभिहस्तांतरणपत्र', 'खरेदीखत', 'विक्री करारनामा',
    'अँग्रीमेंट टू सेल', 'डीड ऑफ अपार्टमेंट', 'ट्रान्सफर डीड', 'साठेखत',
    'सेल सर्टिफिकेट', 'सर्टिफिकेट ऑफ सेल', 'कन्व्हेन्स डीड',
    'अविभाज्य हिश्याची पूर्ण विक्री', 'अँग्रीमेंट टू सेल ऑफ फ्लॅट', 'असाईनमेंट डीड',
    'विक्री प्रमाणपत्र', 'अँग्रीमेंट टू सेल ऑफ शॉप', 'इकरारनामा', 'खुषखरेदीखत',
    'अँग्रीमेंट टू सेल ऑफ ऑफिस', '59-हस्तांतरण', 'अँग्रीमेंट टू असाईनमेंट',
    'अपार्टमेंट डीड', 'हस्तांतरणपत्र', 'विक्रीपत्र', 'असाईनमेंट+B45 डीड',
    'फरोक्तखरेदीखत', 'विक्री दाखला', 'हस्तांतरणपत्', 'उलट खरेदीखत',
    'मुदत खरेदीखत', 'मानीव अभिहस्तांतरण', '59हस्तांतरण',
}


LEASE_DOCTYPE = {
    '36-अ-लिव्ह अॅड लायसन्सेस', 'लिव्ह अँणड लायसन्स', 'भाडेपट्टा', 'लीजडीड',
    'किरायानामा', 'अँग्रीमेंट ऑफ ट्रान्स्फर ऑफ टेनन्सी', 'Leave and Licenses',
    'भाडेपट्ट्याचे प्रत्यार्पण', '36-अ-Leave and Licenses', 'भाडेकरार',
    'अँग्रीमेंट टू लीज', 'भाडेपट्ट्याचे हस्तांतरणपत्र', 'असाईनमेंट ऑफ लीज',
    'ट्रान्सफर ऑफ लीज', '36-अ-Leave And Licenses', 'Leave And Licenses',
}


def categorise(df: pd.DataFrame) -> pd.DataFrame:
    """Categorise transactions as Sale / Lease / Otherbased on the docname column."""

    conditions = [
        df['docname'].isin(SALE_DOCTYPE),
        df['docname'].isin(LEASE_DOCTYPE),
    ]
    df['transaction_category'] = np.select(conditions,['Sale', 'Lease'],default='Other')
    return df